{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"name": "0", "class_name": "InputLayer", "config": {"batch_input_shape": [1, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "0"}, "inbound_nodes": []}, {"name": "1", "class_name": "Conv2D", "config": {"name": "1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["0", 0, 0, {}]]]}, {"name": "2", "class_name": "BatchNormalization", "config": {"name": "2", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["1", 0, 0, {}]]]}, {"name": "3", "class_name": "LeakyReLU", "config": {"name": "3", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["2", 0, 0, {}]]]}, {"name": "4", "class_name": "MaxPooling2D", "config": {"name": "4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["3", 0, 0, {}]]]}, {"name": "5", "class_name": "Conv2D", "config": {"name": "5", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["4", 0, 0, {}]]]}, {"name": "6", "class_name": "BatchNormalization", "config": {"name": "6", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["5", 0, 0, {}]]]}, {"name": "7", "class_name": "LeakyReLU", "config": {"name": "7", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["6", 0, 0, {}]]]}, {"name": "8", "class_name": "MaxPooling2D", "config": {"name": "8", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["7", 0, 0, {}]]]}, {"name": "9", "class_name": "Conv2D", "config": {"name": "9", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["8", 0, 0, {}]]]}, {"name": "10", "class_name": "BatchNormalization", "config": {"name": "10", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["9", 0, 0, {}]]]}, {"name": "11", "class_name": "LeakyReLU", "config": {"name": "11", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["10", 0, 0, {}]]]}, {"name": "12", "class_name": "Conv2D", "config": {"name": "12", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["11", 0, 0, {}]]]}, {"name": "13", "class_name": "BatchNormalization", "config": {"name": "13", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["12", 0, 0, {}]]]}, {"name": "14", "class_name": "LeakyReLU", "config": {"name": "14", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["13", 0, 0, {}]]]}, {"name": "15", "class_name": "Conv2D", "config": {"name": "15", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["14", 0, 0, {}]]]}, {"name": "16", "class_name": "BatchNormalization", "config": {"name": "16", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["15", 0, 0, {}]]]}, {"name": "17", "class_name": "LeakyReLU", "config": {"name": "17", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["16", 0, 0, {}]]]}, {"name": "18", "class_name": "Conv2D", "config": {"name": "18", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["17", 0, 0, {}]]]}, {"name": "19", "class_name": "BatchNormalization", "config": {"name": "19", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["18", 0, 0, {}]]]}, {"name": "20", "class_name": "LeakyReLU", "config": {"name": "20", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["19", 0, 0, {}]]]}, {"name": "21", "class_name": "MaxPooling2D", "config": {"name": "21", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["20", 0, 0, {}]]]}, {"name": "22", "class_name": "Conv2D", "config": {"name": "22", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["21", 0, 0, {}]]]}, {"name": "23", "class_name": "BatchNormalization", "config": {"name": "23", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["22", 0, 0, {}]]]}, {"name": "24", "class_name": "LeakyReLU", "config": {"name": "24", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["23", 0, 0, {}]]]}, {"name": "25", "class_name": "Conv2D", "config": {"name": "25", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["24", 0, 0, {}]]]}, {"name": "26", "class_name": "BatchNormalization", "config": {"name": "26", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["25", 0, 0, {}]]]}, {"name": "27", "class_name": "LeakyReLU", "config": {"name": "27", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["26", 0, 0, {}]]]}, {"name": "28", "class_name": "Conv2D", "config": {"name": "28", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["27", 0, 0, {}]]]}, {"name": "29", "class_name": "BatchNormalization", "config": {"name": "29", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["28", 0, 0, {}]]]}, {"name": "30", "class_name": "LeakyReLU", "config": {"name": "30", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["29", 0, 0, {}]]]}, {"name": "31", "class_name": "Conv2D", "config": {"name": "31", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["30", 0, 0, {}]]]}, {"name": "32", "class_name": "BatchNormalization", "config": {"name": "32", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["31", 0, 0, {}]]]}, {"name": "33", "class_name": "LeakyReLU", "config": {"name": "33", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["32", 0, 0, {}]]]}, {"name": "34", "class_name": "MaxPooling2D", "config": {"name": "34", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["33", 0, 0, {}]]]}, {"name": "35", "class_name": "Conv2D", "config": {"name": "35", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["34", 0, 0, {}]]]}, {"name": "36", "class_name": "BatchNormalization", "config": {"name": "36", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["35", 0, 0, {}]]]}, {"name": "37", "class_name": "LeakyReLU", "config": {"name": "37", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["36", 0, 0, {}]]]}, {"name": "38", "class_name": "Conv2D", "config": {"name": "38", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["37", 0, 0, {}]]]}, {"name": "39", "class_name": "BatchNormalization", "config": {"name": "39", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["38", 0, 0, {}]]]}, {"name": "40", "class_name": "LeakyReLU", "config": {"name": "40", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["39", 0, 0, {}]]]}, {"name": "41", "class_name": "Conv2D", "config": {"name": "41", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["40", 0, 0, {}]]]}, {"name": "42", "class_name": "BatchNormalization", "config": {"name": "42", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["41", 0, 0, {}]]]}, {"name": "43", "class_name": "LeakyReLU", "config": {"name": "43", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["42", 0, 0, {}]]]}, {"name": "44", "class_name": "Conv2D", "config": {"name": "44", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["43", 0, 0, {}]]]}, {"name": "45", "class_name": "BatchNormalization", "config": {"name": "45", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["44", 0, 0, {}]]]}, {"name": "46", "class_name": "LeakyReLU", "config": {"name": "46", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["45", 0, 0, {}]]]}, {"name": "47", "class_name": "Conv2D", "config": {"name": "47", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["46", 0, 0, {}]]]}, {"name": "48", "class_name": "BatchNormalization", "config": {"name": "48", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["47", 0, 0, {}]]]}, {"name": "49", "class_name": "LeakyReLU", "config": {"name": "49", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["48", 0, 0, {}]]]}, {"name": "50", "class_name": "Conv2D", "config": {"name": "50", "trainable": true, "dtype": "float32", "filters": 1000, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["49", 0, 0, {}]]]}, {"name": "51", "class_name": "AveragePooling2D", "config": {"name": "51", "trainable": true, "dtype": "float32", "pool_size": [14, 14], "padding": "same", "strides": [14, 14], "data_format": "channels_last"}, "inbound_nodes": [[["50", 0, 0, {}]]]}, {"name": "52", "class_name": "Flatten", "config": {"name": "52", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["51", 0, 0, {}]]]}, {"name": "53", "class_name": "Softmax", "config": {"name": "53", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["52", 0, 0, {}]]]}], "input_layers": [["0", 0, 0]], "output_layers": [["53", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 1e-09, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "10/gamma", "shape": [16], "dtype": "float32"}, {"name": "10/beta", "shape": [16], "dtype": "float32"}, {"name": "10/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "10/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "12/kernel", "shape": [3, 3, 16, 128], "dtype": "float32"}, {"name": "13/gamma", "shape": [128], "dtype": "float32"}, {"name": "13/beta", "shape": [128], "dtype": "float32"}, {"name": "13/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "13/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "15/kernel", "shape": [1, 1, 128, 16], "dtype": "float32"}, {"name": "16/gamma", "shape": [16], "dtype": "float32"}, {"name": "16/beta", "shape": [16], "dtype": "float32"}, {"name": "16/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "16/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "18/kernel", "shape": [3, 3, 16, 128], "dtype": "float32"}, {"name": "19/gamma", "shape": [128], "dtype": "float32"}, {"name": "19/beta", "shape": [128], "dtype": "float32"}, {"name": "19/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "19/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "2/gamma", "shape": [16], "dtype": "float32"}, {"name": "2/beta", "shape": [16], "dtype": "float32"}, {"name": "2/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "2/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "22/kernel", "shape": [1, 1, 128, 32], "dtype": "float32"}, {"name": "23/gamma", "shape": [32], "dtype": "float32"}, {"name": "23/beta", "shape": [32], "dtype": "float32"}, {"name": "23/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "23/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "25/kernel", "shape": [3, 3, 32, 256], "dtype": "float32"}, {"name": "26/gamma", "shape": [256], "dtype": "float32"}, {"name": "26/beta", "shape": [256], "dtype": "float32"}, {"name": "26/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "26/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "28/kernel", "shape": [1, 1, 256, 32], "dtype": "float32"}, {"name": "29/gamma", "shape": [32], "dtype": "float32"}, {"name": "29/beta", "shape": [32], "dtype": "float32"}, {"name": "29/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "29/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "31/kernel", "shape": [3, 3, 32, 256], "dtype": "float32"}, {"name": "32/gamma", "shape": [256], "dtype": "float32"}, {"name": "32/beta", "shape": [256], "dtype": "float32"}, {"name": "32/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "32/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "35/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "36/gamma", "shape": [64], "dtype": "float32"}, {"name": "36/beta", "shape": [64], "dtype": "float32"}, {"name": "36/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "36/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "38/kernel", "shape": [3, 3, 64, 512], "dtype": "float32"}, {"name": "39/gamma", "shape": [512], "dtype": "float32"}, {"name": "39/beta", "shape": [512], "dtype": "float32"}, {"name": "39/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "39/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "41/kernel", "shape": [1, 1, 512, 64], "dtype": "float32"}, {"name": "42/gamma", "shape": [64], "dtype": "float32"}, {"name": "42/beta", "shape": [64], "dtype": "float32"}, {"name": "42/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "42/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "44/kernel", "shape": [3, 3, 64, 512], "dtype": "float32"}, {"name": "45/gamma", "shape": [512], "dtype": "float32"}, {"name": "45/beta", "shape": [512], "dtype": "float32"}, {"name": "45/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "45/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "47/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "48/gamma", "shape": [128], "dtype": "float32"}, {"name": "48/beta", "shape": [128], "dtype": "float32"}, {"name": "48/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "48/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "5/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "50/kernel", "shape": [1, 1, 128, 1000], "dtype": "float32"}, {"name": "50/bias", "shape": [1000], "dtype": "float32"}, {"name": "6/gamma", "shape": [32], "dtype": "float32"}, {"name": "6/beta", "shape": [32], "dtype": "float32"}, {"name": "6/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "6/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "9/kernel", "shape": [1, 1, 32, 16], "dtype": "float32"}]}]}