{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.2.10.1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "MNIST", "layers": [{"name": "0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "0"}, "inbound_nodes": []}, {"name": "1", "class_name": "Conv2D", "config": {"name": "1", "trainable": true, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["0", 0, 0, {}]]]}, {"name": "2", "class_name": "MaxPooling2D", "config": {"name": "2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["1", 0, 0, {}]]]}, {"name": "3", "class_name": "Conv2D", "config": {"name": "3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["2", 0, 0, {}]]]}, {"name": "4", "class_name": "MaxPooling2D", "config": {"name": "4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["3", 0, 0, {}]]]}, {"name": "5", "class_name": "Flatten", "config": {"name": "5", "trainable": true, "batch_input_shape": [null, 7, 7, 32], "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["4", 0, 0, {}]]]}, {"name": "6", "class_name": "Dense", "config": {"name": "6", "trainable": true, "dtype": "float32", "units": 40, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["5", 0, 0, {}]]]}, {"name": "7", "class_name": "Dense", "config": {"name": "7", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["6", 0, 0, {}]]]}], "input_layers": [["0", 0, 0]], "output_layers": [["7", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}, "loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "1/kernel", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "1/bias", "shape": [16], "dtype": "float32"}, {"name": "3/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "3/bias", "shape": [32], "dtype": "float32"}, {"name": "6/kernel", "shape": [1568, 40], "dtype": "float32"}, {"name": "6/bias", "shape": [40], "dtype": "float32"}, {"name": "7/kernel", "shape": [40, 10], "dtype": "float32"}, {"name": "7/bias", "shape": [10], "dtype": "float32"}]}]}